testTesults/stage_5/1_get_empty_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.945ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 3.862ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 3.943ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 3.980ms, rate sampling interval: 22ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.68ms    4.64ms  34.43ms   84.32%
    Req/Sec   258.63     75.46   700.00     76.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    4.95ms
 90.000%   10.92ms
 99.000%   19.28ms
 99.900%   26.22ms
 99.990%   31.95ms
 99.999%   34.46ms
100.000%   34.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.214     0.000000            1         1.00
       0.533     0.100000         2006         1.11
       0.719     0.200000         4008         1.25
       0.897     0.300000         6000         1.43
       1.069     0.400000         8011         1.67
       1.251     0.500000        10001         2.00
       1.368     0.550000        11007         2.22
       1.926     0.600000        11999         2.50
       2.745     0.650000        13000         2.86
       3.707     0.700000        13999         3.33
       4.951     0.750000        15000         4.00
       5.695     0.775000        15498         4.44
       6.523     0.800000        15997         5.00
       7.467     0.825000        16497         5.71
       8.599     0.850000        16998         6.67
       9.663     0.875000        17499         8.00
      10.215     0.887500        17750         8.89
      10.919     0.900000        18001        10.00
      11.647     0.912500        18247        11.43
      12.455     0.925000        18498        13.33
      13.343     0.937500        18750        16.00
      13.775     0.943750        18873        17.78
      14.311     0.950000        18997        20.00
      14.895     0.956250        19124        22.86
      15.519     0.962500        19249        26.67
      16.151     0.968750        19372        32.00
      16.463     0.971875        19438        35.56
      16.799     0.975000        19498        40.00
      17.151     0.978125        19560        45.71
      17.567     0.981250        19622        53.33
      18.031     0.984375        19686        64.00
      18.287     0.985938        19716        71.11
      18.543     0.987500        19747        80.00
      18.943     0.989062        19778        91.43
      19.455     0.990625        19809       106.67
      19.935     0.992188        19840       128.00
      20.127     0.992969        19856       142.22
      20.575     0.993750        19872       160.00
      20.991     0.994531        19888       182.86
      21.423     0.995313        19905       213.33
      21.711     0.996094        19918       256.00
      21.919     0.996484        19926       284.44
      22.143     0.996875        19934       320.00
      22.687     0.997266        19943       365.71
      23.535     0.997656        19951       426.67
      23.919     0.998047        19957       512.00
      24.655     0.998242        19961       568.89
      24.815     0.998437        19965       640.00
      25.183     0.998633        19969       731.43
      25.679     0.998828        19973       853.33
      26.351     0.999023        19977      1024.00
      26.655     0.999121        19979      1137.78
      26.911     0.999219        19981      1280.00
      27.439     0.999316        19983      1462.86
      28.287     0.999414        19985      1706.67
      29.391     0.999512        19987      2048.00
      29.407     0.999561        19988      2275.56
      29.471     0.999609        19989      2560.00
      30.095     0.999658        19990      2925.71
      30.831     0.999707        19991      3413.33
      31.519     0.999756        19992      4096.00
      31.519     0.999780        19992      4551.11
      31.535     0.999805        19993      5120.00
      31.535     0.999829        19993      5851.43
      31.951     0.999854        19994      6826.67
      31.951     0.999878        19994      8192.00
      31.951     0.999890        19994      9102.22
      32.271     0.999902        19995     10240.00
      32.271     0.999915        19995     11702.86
      32.271     0.999927        19995     13653.33
      32.271     0.999939        19995     16384.00
      32.271     0.999945        19995     18204.44
      34.463     0.999951        19996     20480.00
      34.463     1.000000        19996          inf
#[Mean    =        3.683, StdDeviation   =        4.641]
#[Max     =       34.432, Total count    =        19996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 30.02s, 2.45MB read
  Non-2xx or 3xx responses: 30004
Requests/sec:    999.61
Transfer/sec:     83.68KB
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.156ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 3.196ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 3.068ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 3.197ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.27ms    4.05ms  32.21ms   86.16%
    Req/Sec   261.06     87.90   764.00     76.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.31ms
 75.000%    4.03ms
 90.000%    9.18ms
 99.000%   18.61ms
 99.900%   24.58ms
 99.990%   28.37ms
 99.999%   32.22ms
100.000%   32.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.248     0.000000            1         1.00
       0.597     0.100000         2000         1.11
       0.785     0.200000         4001         1.25
       0.972     0.300000         6014         1.43
       1.143     0.400000         8002         1.67
       1.309     0.500000         9998         2.00
       1.454     0.550000        10996         2.22
       1.864     0.600000        11996         2.50
       2.473     0.650000        12995         2.86
       3.169     0.700000        13994         3.33
       4.027     0.750000        14994         4.00
       4.583     0.775000        15494         4.44
       5.183     0.800000        15995         5.00
       5.931     0.825000        16493         5.71
       6.787     0.850000        16994         6.67
       7.943     0.875000        17493         8.00
       8.559     0.887500        17748         8.89
       9.175     0.900000        17994        10.00
       9.799     0.912500        18244        11.43
      10.535     0.925000        18494        13.33
      11.399     0.937500        18743        16.00
      11.967     0.943750        18869        17.78
      12.575     0.950000        18993        20.00
      13.167     0.956250        19117        22.86
      13.783     0.962500        19242        26.67
      14.511     0.968750        19367        32.00
      14.927     0.971875        19429        35.56
      15.327     0.975000        19492        40.00
      15.831     0.978125        19554        45.71
      16.431     0.981250        19617        53.33
      17.103     0.984375        19679        64.00
      17.567     0.985938        19711        71.11
      17.967     0.987500        19744        80.00
      18.367     0.989062        19774        91.43
      18.735     0.990625        19808       106.67
      19.103     0.992188        19835       128.00
      19.391     0.992969        19851       142.22
      19.663     0.993750        19867       160.00
      20.127     0.994531        19882       182.86
      20.559     0.995313        19898       213.33
      20.975     0.996094        19914       256.00
      21.135     0.996484        19921       284.44
      21.375     0.996875        19929       320.00
      21.647     0.997266        19937       365.71
      21.999     0.997656        19946       426.67
      22.159     0.998047        19952       512.00
      22.559     0.998242        19956       568.89
      22.927     0.998437        19960       640.00
      23.423     0.998633        19964       731.43
      24.447     0.998828        19968       853.33
      24.591     0.999023        19973      1024.00
      24.607     0.999121        19974      1137.78
      24.687     0.999219        19977      1280.00
      24.703     0.999316        19979      1462.86
      24.847     0.999414        19980      1706.67
      24.927     0.999512        19982      2048.00
      25.391     0.999561        19983      2275.56
      25.487     0.999609        19984      2560.00
      26.319     0.999658        19985      2925.71
      27.231     0.999707        19986      3413.33
      27.247     0.999756        19987      4096.00
      27.247     0.999780        19987      4551.11
      27.967     0.999805        19988      5120.00
      27.967     0.999829        19988      5851.43
      28.367     0.999854        19989      6826.67
      28.367     0.999878        19989      8192.00
      28.367     0.999890        19989      9102.22
      28.479     0.999902        19990     10240.00
      28.479     0.999915        19990     11702.86
      28.479     0.999927        19990     13653.33
      28.479     0.999939        19990     16384.00
      28.479     0.999945        19990     18204.44
      32.223     0.999951        19991     20480.00
      32.223     1.000000        19991          inf
#[Mean    =        3.275, StdDeviation   =        4.050]
#[Max     =       32.208, Total count    =        19991]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30000 requests in 30.00s, 3.58MB read
  Non-2xx or 3xx responses: 30000
Requests/sec:   1000.11
Transfer/sec:    122.08KB
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.684ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.661ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.668ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.679ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.98ms    4.32ms  31.26ms   85.86%
    Req/Sec   274.01    125.99     1.11k    80.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.09ms
 75.000%    2.61ms
 90.000%    9.60ms
 99.000%   19.02ms
 99.900%   24.86ms
 99.990%   28.75ms
 99.999%   31.28ms
100.000%   31.28ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.214     0.000000            1         1.00
       0.513     0.100000         2011         1.11
       0.654     0.200000         4001         1.25
       0.802     0.300000         6010         1.43
       0.943     0.400000         8007         1.67
       1.085     0.500000        10000         2.00
       1.156     0.550000        11007         2.22
       1.224     0.600000        12013         2.50
       1.287     0.650000        12999         2.86
       1.386     0.700000        13998         3.33
       2.607     0.750000        14997         4.00
       3.423     0.775000        15497         4.44
       4.451     0.800000        15997         5.00
       5.627     0.825000        16497         5.71
       6.843     0.850000        16998         6.67
       8.231     0.875000        17497         8.00
       8.927     0.887500        17747         8.89
       9.607     0.900000        17998        10.00
      10.391     0.912500        18250        11.43
      11.231     0.925000        18497        13.33
      12.215     0.937500        18749        16.00
      12.807     0.943750        18872        17.78
      13.375     0.950000        18997        20.00
      14.015     0.956250        19122        22.86
      14.679     0.962500        19247        26.67
      15.415     0.968750        19374        32.00
      15.799     0.971875        19437        35.56
      16.167     0.975000        19497        40.00
      16.687     0.978125        19559        45.71
      17.135     0.981250        19622        53.33
      17.711     0.984375        19684        64.00
      18.031     0.985938        19715        71.11
      18.415     0.987500        19747        80.00
      18.815     0.989062        19778        91.43
      19.183     0.990625        19809       106.67
      19.615     0.992188        19842       128.00
      19.871     0.992969        19856       142.22
      20.191     0.993750        19872       160.00
      20.559     0.994531        19887       182.86
      21.023     0.995313        19903       213.33
      21.375     0.996094        19918       256.00
      21.759     0.996484        19926       284.44
      22.111     0.996875        19934       320.00
      22.559     0.997266        19942       365.71
      22.815     0.997656        19950       426.67
      23.167     0.998047        19957       512.00
      23.375     0.998242        19961       568.89
      23.647     0.998437        19965       640.00
      24.319     0.998633        19969       731.43
      24.559     0.998828        19973       853.33
      24.911     0.999023        19977      1024.00
      25.311     0.999121        19980      1137.78
      25.487     0.999219        19981      1280.00
      26.143     0.999316        19983      1462.86
      26.367     0.999414        19985      1706.67
      26.527     0.999512        19987      2048.00
      26.591     0.999561        19988      2275.56
      26.655     0.999609        19989      2560.00
      26.847     0.999658        19990      2925.71
      26.895     0.999707        19991      3413.33
      28.015     0.999756        19992      4096.00
      28.015     0.999780        19992      4551.11
      28.239     0.999805        19993      5120.00
      28.239     0.999829        19993      5851.43
      28.751     0.999854        19994      6826.67
      28.751     0.999878        19994      8192.00
      28.751     0.999890        19994      9102.22
      28.815     0.999902        19995     10240.00
      28.815     0.999915        19995     11702.86
      28.815     0.999927        19995     13653.33
      28.815     0.999939        19995     16384.00
      28.815     0.999945        19995     18204.44
      31.279     0.999951        19996     20480.00
      31.279     1.000000        19996          inf
#[Mean    =        2.977, StdDeviation   =        4.323]
#[Max     =       31.264, Total count    =        19996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 30.00s, 3.58MB read
  Non-2xx or 3xx responses: 30004
Requests/sec:   1000.10
Transfer/sec:    122.08KB